cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСтроения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителейПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеЗаписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПлит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутКонтроллера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаНедобавленнаяВФИАС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргУлицыНедобавленныеВФИАС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВетхостьСтроения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТочекПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваОбщедомовой</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргПомещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКатегорииПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиктивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonModules/энргПроведениеСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура выполняет пордготовку наборов записей документа к записи движений.
//  1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
//  2. Взводит флаг записи у наборов, по которым документ имеет движения
//  Вызывается из модуля документов при проведении.
//
// Параметры:
//  Объект	 - ДокументОбъект - наборы записей которого нудно подготовить
//  ЭтоНовый - Булево - признак нового документа
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект, ЭтоНовый = Ложь) Экспорт
	
	Перем ЭтоНовыйДокумент, МетаданныеДвижения;
	
	Для Каждого НаборЗаписей Из Объект.Движения Цикл

		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;

	КонецЦикла;
	
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовыйДокумент) Тогда
		ЭтоНовыйДокумент = ЭтоНовый;
	КонецЕсли;
	
	МетаданныеДвижения = Объект.Метаданные().Движения;
	Для Каждого ИмяРегистра Из МетаданныеДвижения Цикл
		Объект.Движения[ИмяРегистра.Имя].Записывать = Истина;
	КонецЦикла;
	

КонецПроцедуры

// Процедура выполняет подготовку наборов записей документа к проведению документа.
// 1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте).
// 2. Взводит флаг записи у наборов, по которым документ имел движения при прошлом проведении.
// 3. Устанавливает активность наборам записей документов с установленным флагом ручной корректировки.
// 4. Записывает пустые наборы, если дата ранее проведенного документа была сдвинута вперед.
// Вызывается из модуля документа при проведении.
//
Процедура ПодготовитьНаборыЗаписейКПроведению(Объект, ВыборочноОчищатьРегистры = Истина) Экспорт
	
	Для каждого НаборЗаписей Из Объект.Движения Цикл
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;		
		НаборЗаписей.записывать = истина;
	КонецЦикла;

	Если Объект.ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
			
	Если Объект.ДополнительныеСвойства.ДатаДокументаСдвинутаВперед Тогда
		Объект.Движения.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьНаборыЗаписей(Объект) Экспорт 
	
	ДополнительныеСвойства 	= Объект.ДополнительныеСвойства;
	Движения 				= Объект.Движения;
	ТаблицыДвижений 		= ДополнительныеСвойства.ТаблицыДвижений;
	КлючиТаблицДвижений 	= ДополнительныеСвойства.КлючиТаблицДвижений;
	Для Каждого КлючЗначение Из КлючиТаблицДвижений Цикл
		Если Движения.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
			Движения[КлючЗначение.Ключ].Загрузить(ТаблицыДвижений[КлючЗначение.Значение].Выгрузить());
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

Функция ВыполнитьКонтрольПроведения(Объект) Экспорт 

	Результат = "";
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
	Если Не ДополнительныеСвойства.Свойство("ТаблицыДляКонтроля") Тогда
		Возврат Результат;
	КонецЕсли;	
	
	Ошибки = Новый Массив;
	ТаблицыКонтроля = ДополнительныеСвойства.ТаблицыДляКонтроля;
	КлючиТаблицКонтроля = ДополнительныеСвойства.КлючиТаблицКонтроля;
	Для Каждого КлючЗначение Из КлючиТаблицКонтроля Цикл
		
		РезультатЗапроса = ТаблицыКонтроля[КлючЗначение.Значение];
		Выборка	= РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Ошибки.Добавить(Выборка.ТекстСообщения);			
		КонецЦикла;
		
	КонецЦикла;

	Если Ошибки.Количество() > 0 Тогда
		ЗаголовокСообщения 	= НСтр("ru = 'Проведение не выполнено по причине:'");
		Результат = ЗаголовокСообщения + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт 
	
	ДополнительныеСвойства 			= Объект.ДополнительныеСвойства;
	
	Если Не ДополнительныеСвойства.Свойство("ТаблицыДляКонтроля") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыКонтроля 				= ДополнительныеСвойства.ТаблицыДляКонтроля;
	КлючиТаблицКонтроля 			= ДополнительныеСвойства.КлючиТаблицКонтроля;
	Для Каждого КлючЗначение Из КлючиТаблицКонтроля Цикл
		 Результат 					= ТаблицыКонтроля[КлючЗначение.Значение];
		 Выборка 					= Результат.Выбрать();
		 Пока Выборка.Следующий() Цикл			 
			 ЗаголовокСообщения 	= НСтр("ru = 'Проведение не выполнено %ПредставлениеОбъекта%'");
			 ТекстСообщения 		= СтрЗаменить(ЗаголовокСообщения, "%ПредставлениеОбъекта%", Выборка.ПредставлениеОбъекта) + " " + Выборка.ТекстСообщения;
			 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			 Отказ 					= Истина;
		 КонецЦикла; 		 
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписьюОбъекта(Источник) Экспорт
	
	ЭтоНовый 				= Не ЗначениеЗаполнено(Источник.Ссылка);
	ТипИсточника 			= ТипЗнч(Источник);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый);
	ДопСвойства 			= Источник.ДополнительныеСвойства;
	Если не ЭтоНовый тогда
				
		Если ДопСвойства.Свойство("ДатаПриОткрытии") тогда
			ДатаПриОткрытии = ДопСвойства.ДатаПриОткрытии;
		иначе
			ДатаПриОткрытии = Источник.Дата;
		КонецЕсли;		
		
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",ДатаПриОткрытии<Источник.Дата);		
				
	иначе
		Источник.ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед",Ложь);
	КонецЕсли; 
		
	Если ДопСвойства.свойство("ГруппаАбонентов") тогда
		Если ДопСвойства.ГруппаАбонентов тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Инструменты  				= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	ДанныеПоследовательности  	= Инструменты.ДанныеПоследовательности(ТипИсточника);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КлючПомещения",		Источник.метаданные()) тогда 
		энргПроведениеСервер.ПрочитатьДанныеСтроения(Источник);
	КонецЕсли;
		
	Если ДанныеПоследовательности.Регистрируется тогда
		ДобавитьПараметрыПоследовательности(Источник,ТипИсточника,ДанныеПоследовательности.Взаиморасчеты);
	КонецЕсли;  		 
		
КонецПроцедуры 

Процедура ПрочитатьДанныеСтроения(Источник) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник,"КлючПомещения") Тогда 
		
		Запрос  		= Новый Запрос;
		Запрос.УстановитьПараметр("КлючПомещения", Источник.КлючПомещения);
		Запрос.Текст 	=
		"ВЫБРАТЬ
		|	энргКлючиПомещений.Строение КАК Строение,
		|	энргКлючиПомещений.Помещение КАК Помещение,
		|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
		|ИЗ
		|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|ГДЕ
		|	энргКлючиПомещений.КлючПомещения = &КлючПомещения";
		
		ДанныеСтроения 		= Новый Структура("Строение,Помещение,ЧастныйСектор",Справочники.энргСтроения.ПустаяСсылка(),Справочники.энргПомещения.ПустаяСсылка(),Ложь);
		Результат  			= Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка 		= Результат.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(ДанныеСтроения, Выборка);
		КонецЕсли;
		
		Источник.ДополнительныеСвойства.Вставить("ДанныеСтроения", ДанныеСтроения);
		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник,"МКД") И  ЗначениеЗаполнено(Источник.МКД) Тогда 
		
		ДанныеСтроения 		= Новый Структура("Строение,Помещение,ЧастныйСектор", Источник.МКД, Справочники.энргПомещения.ПустаяСсылка(), Ложь);
		Источник.ДополнительныеСвойства.Вставить("ДанныеСтроения", ДанныеСтроения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПараметрыПоследовательности(Источник,ТипИсточника,ИзменяетВзаиморасчеты)
		
	ПараметрыПроведения 											= Новый Структура;	
	
	ДокументыРегистрируемыеЗаднимЧислом 							= ДокументыРегистрируемыеЗаднимЧислом();
			
	Если ДокументыРегистрируемыеЗаднимЧислом.найти(ТипИсточника) <>Неопределено тогда
		ПараметрыПроведения.вставить("ПериодРегистрации",?(ЗначениеЗаполнено(Источник.ДатаФактическогоСобытия),КонецДня(Источник.ДатаФактическогоСобытия),Источник.Дата)); 
	КонецЕсли; 
	
	ПараметрыПроведения.Вставить("ПериодНачисления",				Источник.ПериодНачисления);		
	ПараметрыПроведения.Вставить("Район",							Источник.Район);
	ПараметрыПроведения.Вставить("Организация",						Источник.Организация);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КлючПомещения",		Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("Строение",					Источник.ДополнительныеСвойства.ДанныеСтроения.Строение);
		ПараметрыПроведения.Вставить("Помещение",					Источник.ДополнительныеСвойства.ДанныеСтроения.Помещение);
		ПараметрыПроведения.Вставить("ЧастныйСектор",				Источник.ДополнительныеСвойства.ДанныеСтроения.ЧастныйСектор);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("МКД",		Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("МКД",							Источник.МКД);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Абонент",			Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("Абонент",						Источник.Абонент);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Договор",			Источник.метаданные()) тогда
		ПараметрыПроведения.Вставить("Договор",						Источник.Договор);
	КонецЕсли;

	Если ИзменяетВзаиморасчеты тогда
		ПараметрыПроведения.Вставить("Кассир",						Источник.ДополнительныеСвойства.Кассир);
		ПараметрыПроведения.Вставить("ИсточникПоступления",			Источник.ДополнительныеСвойства.ИсточникПоступления);
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоОплата") Тогда
			ПараметрыПроведения.Вставить("ЭтоОплата",				Источник.ДополнительныеСвойства.ЭтоОплата);
		КонецЕсли; 		
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.вставить("ПараметрыПроведения",	ПараметрыПроведения);
		
КонецПроцедуры

Функция ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Экспорт 
	Возврат Истина;
КонецФункции

Процедура ВыполнитьДвиженияПоРезультатуЗапроса(РезультатЗапроса, ДвиженияНабор, СоответствиеКолонок = Неопределено)  Экспорт
	Выборка	= РезультатЗапроса.выбрать();	
	Пока Выборка.Следующий() цикл		
		Запись	= ДвиженияНабор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Если СоответствиеКолонок <> Неопределено Тогда 
			ДЛя Каждого ТекСоответствие Из СоответствиеКолонок Цикл
				Запись[ТекСоответствие.Ключ] = Выборка[ТекСоответствие.Значение];
			КонецЦикла;	
		КонецЕсли;			                                       
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(МассивРеквизитов, ЭлементМассива);		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЧтенииОбъектаНаСервере(ТекущийОбъект,ПараметрыПриОткрытии,ДатаПриОткрытии) Экспорт
	
	ПараметрыПриОткрытии = Новый Структура;
	ПараметрыПриОткрытии.Вставить("ПериодНачисления",энргРаботаСПериодомДействия.ОпределитьОтчетныйПериод(ТекущийОбъект.дата));
	ПараметрыПриОткрытии.Вставить("Район",ТекущийОбъект.район);
	ПараметрыПриОткрытии.Вставить("МКД",ТекущийОбъект.МКД);
	ПараметрыПриОткрытии.Вставить("Абонент",ТекущийОбъект.Абонент);
	
	ДатаПриОткрытии = ТекущийОбъект.дата;

КонецПроцедуры

Процедура ПередЗаписьюОбъектаНаСервере(ТекущийОбъект,ПараметрыПриОткрытии,ДатаПриОткрытии) Экспорт 
	
	ДопСвойства = ТекущийОбъект.ДополнительныеСвойства;
	Если ТипЗнч(ПараметрыПриОткрытии)  = Тип("Структура") тогда
		ДопСвойства.вставить("ПараметрыПриОткрытии",ПараметрыПриОткрытии);
	КонецЕсли;
	
	ДопСвойства.вставить("ДатаПриОткрытии",ДатаПриОткрытии);
	
КонецПроцедуры

Процедура ДанныеСтроенийВоВременную(МВТ, КлючиПомещений, ИмяТаблицы) Экспорт
		
	Текст 	=
	"ВЫБРАТЬ
	|	энргКлючиПомещений.КлючПомещения КАК КлючПомещения,
	|	энргКлючиПомещений.Строение КАК Строение,
	|	энргКлючиПомещений.Помещение КАК Помещение,
	|	энргКлючиПомещений.ЧастныйСектор КАК ЧастныйСектор
	|ПОМЕСТИТЬ " + ИмяТаблицы + "
	|ИЗ
	|	РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.КлючПомещения в (&КлючиПомещений)";
	
	Запрос  							= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.УстановитьПараметр("КлючиПомещений", КлючиПомещений);	
	Запрос.Выполнить();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументыРегистрируемыеЗаднимЧислом()
	Массив  = Новый Массив;
	Массив.Добавить(Тип("ДокументОбъект.энргОперацияСЛицевымСчетом"));
	Массив.Добавить(Тип("ДокументОбъект.энргОперацияСУслугами"));
	Массив.Добавить(Тип("ДокументОбъект.энргОперацияСПриборомУчета"));
	Массив.Добавить(Тип("ДокументОбъект.энргРегистрацияВременногоОтсутствия"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьВидБлагоустройстваАбонента"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьГруппуПотребителейАбонента"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьДатуПоверкиПУ"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьЗначениеПлощади"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьКоличествоКомнат"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьКоличествоПрописанных")); 	
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьКоличествоПроживающих"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьКоличествоСобственников"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьФормулуРасчетаТочекУчета"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьТехническуюВозможностьУстановкиПУ"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьДополнительнуюСоциальнуюНорму"));
	Массив.Добавить(Тип("ДокументОбъект.энргУстановитьСхемуПодчиненностиТочекУчета"));
	Возврат Массив;
КонецФункции

#КонецОбласти
